In [1]:
import pandas as pd

In [2]:
data = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Carol', 'David', 'Eve'],
    'Age': [20, 22, 19, 21, 20],
    'Gender': ['Female', 'Male', 'Female', 'Male', 'Female'],
    'Marks': [85, 78, 92, 74, 88]
})

data

    Name  Age  Gender  Marks
0  Alice   20  Female     85
1    Bob   22    Male     78
2  Carol   19  Female     92
3  David   21    Male     74
4    Eve   20  Female     88

1. Using the DataFrame from Task 2, write a Python program to:

A. Group the data by Gender and calculate the mean age and
marks for each gender.

In [5]:
group_gender =  data.groupby('Gender')
gender_mean = group_gender[['Age', 'Marks']].mean()

gender_mean

              Age      Marks
Gender
Female  19.666667  88.333333
Male    21.500000  76.000000

B. Count the number of students in each gender group.

In [6]:
data['Gender'].value_counts()

Gender
Female    3
Male      2
Name: count, dtype: int64